# ConstructionIsSchematic Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ConstructionIsSchematic Property
ParameterTypeId Class See Also
---
"Schematic"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ConstructionIsSchematic { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConstructionIsSchematic As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ConstructionIsSchematic {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace